const genText = document.getElementById("gen-text")

genText.addEventListener("click", function() {
  let messages = [
"Сіздің жарқын жүрегіңіз бүгінгі жетістіктеріңіздің тек бастамасы! Жұлдыздардан да жоғары ұшыңыз!",
"Әр күніңіз жаңа мүмкіндіктермен толы болсын. Сізге сенемін! ✨",  
"Сіздің шығармашылығыңыз мен талпынысыңыз — бұл үлкен болашақтың жолы. Алға! 🚀", 
"Қиындықтар сізді мықты етеді. Сіздің табандылығыңыз мені таң қалдырады! 💪", 
"Әрбір сәтсіздік — жаңа бастама. Сізге тілектесімін: ешқашан тоқтамаңыз! 🌱",
"Әрбір жұмысыңыздағы мұқияттылық — болашақтағы табысқа сенімді қадам! 🔍",
"Ұлы ойшылдар да бір кездерде оқушы болды. Сіз де олардың ізімен жүріңіз! 🌍", 
"Білім — бұл қанат. Оны қауырт қаққан сайын, әлем сізге ашылады! 🕊️", 
"Жетістік — бұл құпия емес, тәуекел мен еңбек нәтижесі. Сізде екеуі де бар! 💫", 
"Әрбір жаңа білім — өмірлік сапардағы шам. Оны өшірмеңіз! 🔦", 
"Болашақта сіз өзіңізге сенген кездегі қызыл кілтті есіңізден шығармаңыз. Сіздің потенциалыңыз — шексіз! 🔑", 
"Өмір сізге қиын тапсырмалар береді, бірақ мен білемін: сіз олардың әрқайсысын шешесіз! 🧩", 
"Қайда барсаңыз да, жақсылық пен адалдықты алып жүріңіз. Бұл — сіздің ең мықты қаруыңыз! 🛡️", 
"8 Наурыз — тек бір күн, ал сіз — әлемге мың сәуле әкелесіз. Бақыт сізбен болсын! 🌈", 
"Сіздің нәзік жүрегіңіз бен күш-жігеріңіз әлемді жарықтандырады! Бақыт пен сәттілік сізбен болсын! ✨" ,   
"Әр күніңіз гүлдей берсін, арманыңыз шын болсын! Сізге — шексіз махаббат тілеймін! 🌺",
"Оқу — бұл ғарышқа саяхат. Әрбір сабақ — жаңа планета. Оны зерттеңіз! 🪐",
"💖 Сіздер – болашақтың жарқын жұлдыздарысыздар!",
"💐 Армандарыңыз асқақ, білімдеріңіз терең болсын!",
"🌟 Әр күніңіз шаттыққа, жетістіктерге, бақытқа толы болсын!",
"💖 Сіздерге шексіз бақыт, мықты денсаулық және сәттілік тілеймін!",
"🎓 Білімге деген құштарлығыңыз артып, үлкен жетістіктерге жете беріңіздер!",
"😊 Көңілдеріңіз әрдайым шаттыққа толы болсын, жүректеріңізден мейірім кетпесін!",
"🌟 Армандарыңыз орындалып, өмірлеріңіз гүлдей жайнай берсін!",
"Көктемнің шуағындай жылы, жүректеріңізде қуаныш сыйлайтын тамаша күндер көп болсын! 💐🎉",

  ]
  const textEl = document.querySelector(".textMessage")
  textEl.textContent = messages[Math.floor( Math.random()*messages.length )]
})
